# A = dict()     # словарь
# #A = {}
# A['Ирина'] = 3 #Сначала ключ, потом значение под этим ключом
# A['Александра'] = 5
# A['Ольга'] = 4
# print(A)
# A['Александра'] += 1
# print(A)
# print(A['Ольга'])
# #print(A['Иван']) #Если нет такого то ошибка
#
# for k in A:
#     print(k, A[k])
#
# name = "Олег"
# if name in A:
#     A[name] += 1
#     print(A)
# else:
#     print("Такого тут нет")
#
# A.get(name, "Такого тут нет")

###################################################################################################################

# words = ["Мария", "Анна", "Елена", "Анна", "Олег", "Мария", "Светана", "Елена"]
# stat = dict()
# for x in words:
#     if x in stat:
#         stat[x] += 1
#     else:
#         stat[x] = 1
# print(stat)
#
# #      ||
#
# for x in words:
#     stat[x] = stat.get(x, 0) + 1
# print(stat)

##################################################################################################################

# D = {
#         "ФИО": {"Имя": "Олег", "Фамилия": "Полковский", "Возраст": "36"},
#         "Оценки": [6, 9, 5, 3, 4, 3, 7.5]
# }
# print(D)
# print(D["ФИО"]["Имя"])
# print(max(D["Оценки"]))
# D["Оценки"].append(8)
# print(D)
#
# A = 3 * [dict()]
# print(A)
# A[1]["Дима"] = 3
# print(A)
